#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.regions.data.azapi_client_config.current: Reading...
module.regions.data.azapi_client_config.current: Read complete after 0s [id=clientConfigs/subscriptionId=85f4c871-0572-44e7-830e-de36fb870a37;tenantId=400ebb99-99e3-4a2a-af83-b2b5edff74fa]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMjNmNTI3MS04OWMwLTRjNjYtYjZjNS0yYTRkMzUxMjVmYzI7b2JqZWN0SWQ9NWQ0NGM1NjEtYjFkMS00N2QwLThmNGUtNmQzODk5MDNjMjM5O3N1YnNjcmlwdGlvbklkPTg1ZjRjODcxLTA1NzItNDRlNy04MzBlLWRlMzZmYjg3MGEzNzt0ZW5hbnRJZD00MDBlYmI5OS05OWUzLTRhMmEtYWY4My1iMmI1ZWRmZjc0ZmE=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # azapi_resource_action.purge_ai_foundry will be created
  + resource "azapi_resource_action" "purge_ai_foundry" {
      + id               = (known after apply)
      + method           = "DELETE"
      + output           = (known after apply)
      + resource_id      = (known after apply)
      + sensitive_output = (sensitive value)
      + type             = "Microsoft.Resources/resourceGroups/deletedAccounts@2021-04-30"
      + when             = "destroy"
    }

  # azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = (known after apply)
      + local_authentication_enabled    = (known after apply)
      + location                        = (known after apply)
      + name                            = (known after apply)
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = (known after apply)
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = (known after apply)
      + name     = (known after apply)
    }

  # random_shuffle.locations will be created
  + resource "random_shuffle" "locations" {
      + id           = (known after apply)
      + input        = [
          + "northeurope",
          + "westeurope",
        ]
      + result       = (known after apply)
      + result_count = 3
    }

  # module.ai_foundry.data.azapi_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_client_config" "telemetry" {
      + id                       = (known after apply)
      + object_id                = (known after apply)
      + subscription_id          = (known after apply)
      + subscription_resource_id = (known after apply)
      + tenant_id                = (known after apply)
    }

  # module.ai_foundry.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.ai_foundry.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.azapi_resource.ai_foundry will be created
  + resource "azapi_resource" "ai_foundry" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + kind       = "AIServices"
          + properties = {
              + allowProjectManagement = true
              + customSubDomainName    = (known after apply)
              + disableLocalAuth       = false
              + networkAcls            = {
                  + defaultAction       = "Allow"
                  + ipRules             = []
                  + virtualNetworkRules = []
                }
              + networkInjections      = null
              + publicNetworkAccess    = "Enabled"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts@2025-04-01-preview"
    }

  # module.ai_foundry.azapi_resource.ai_model_deployment["gpt-4o"] will be created
  + resource "azapi_resource" "ai_model_deployment" {
      + body                      = {
          + properties = {
              + model                = {
                  + format  = "OpenAI"
                  + name    = "gpt-4.1"
                  + version = "2025-04-14"
                }
              + raiPolicyName        = null
              + versionUpgradeOption = "OnceNewDefaultVersionAvailable"
            }
          + sku        = {
              + capacity = 1
              + name     = "GlobalStandard"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + name                      = "gpt-4.1"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/deployments@2025-04-01-preview"
    }

  # module.ai_foundry.azapi_resource.ai_search["this"] will be created
  + resource "azapi_resource" "ai_search" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + properties = {
              + authOptions         = {
                  + aadOrApiKey = {
                      + aadAuthFailureMode = "http401WithBearerChallenge"
                    }
                }
              + disableLocalAuth    = false
              + hostingMode         = "default"
              + networkRuleSet      = {
                  + bypass = "None"
                }
              + partitionCount      = 1
              + publicNetworkAccess = "Enabled"
              + replicaCount        = 2
              + semanticSearch      = "disabled"
            }
          + sku        = {
              + name = "standard"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Search/searchServices@2024-06-01-preview"
    }

  # module.ai_foundry.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = (known after apply)
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.ai_foundry.random_string.resource_token will be created
  + resource "random_string" "resource_token" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ai_foundry.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.naming.random_string.first_letter will be created
  + resource "random_string" "first_letter" {
      + id          = (known after apply)
      + length      = 1
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.naming.random_string.main will be created
  + resource "random_string" "main" {
      + id          = (known after apply)
      + length      = 60
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.ai_foundry_project will be created
  + resource "azapi_resource" "ai_foundry_project" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + properties = {
              + description = "Markus AI Playground"
              + displayName = "Markus AI Playground"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = "playground"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
          + "properties.internalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.CognitiveServices/accounts/projects@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.connection_cosmos[0] will be created
  + resource "azapi_resource" "connection_cosmos" {
      + body                      = {
          + properties = {
              + authType = "AAD"
              + category = "CosmosDb"
              + metadata = {
                  + ApiType    = "Azure"
                  + ResourceId = (known after apply)
                  + location   = (known after apply)
                }
              + target   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.connection_search[0] will be created
  + resource "azapi_resource" "connection_search" {
      + body                      = {
          + properties = {
              + authType = "AAD"
              + category = "CognitiveSearch"
              + metadata = {
                  + ApiType    = "Azure"
                  + ApiVersion = "2024-05-01-preview"
                  + ResourceId = (known after apply)
                  + location   = (known after apply)
                }
              + target   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azapi_resource.connection_storage[0] will be created
  + resource "azapi_resource" "connection_storage" {
      + body                      = {
          + properties = {
              + authType = "AAD"
              + category = "AzureStorageAccount"
              + metadata = {
                  + ApiType    = "Azure"
                  + ResourceId = (known after apply)
                  + location   = (known after apply)
                }
              + target   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = (known after apply)
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "identity.principalId",
        ]
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts/projects/connections@2025-04-01-preview"
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.ai_search_role_assignments["search_index_data_contributor"] will be created
  + resource "azurerm_role_assignment" "ai_search_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Index Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.ai_search_role_assignments["search_service_contributor"] will be created
  + resource "azurerm_role_assignment" "ai_search_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Search Service Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.cosmosdb_role_assignments["cosmosdb_operator"] will be created
  + resource "azurerm_role_assignment" "cosmosdb_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Cosmos DB Operator"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].azurerm_role_assignment.storage_role_assignments["storage_blob_data_contributor"] will be created
  + resource "azurerm_role_assignment" "storage_role_assignments" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].time_sleep.wait_project_identities will be created
  + resource "time_sleep" "wait_project_identities" {
      + create_duration = "10s"
      + id              = (known after apply)
    }

  # module.ai_foundry.module.ai_foundry_project["project_1"].time_sleep.wait_rbac_before_capability_host will be created
  + resource "time_sleep" "wait_rbac_before_capability_host" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.data.azapi_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_client_config" "current" {
      + id                       = (known after apply)
      + object_id                = (known after apply)
      + subscription_id          = (known after apply)
      + subscription_resource_id = (known after apply)
      + tenant_id                = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.data.azapi_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azapi_client_config" "telemetry" {
      + id                       = (known after apply)
      + object_id                = (known after apply)
      + subscription_id          = (known after apply)
      + subscription_resource_id = (known after apply)
      + tenant_id                = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry.avm_utl_regions"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.module.avm_utl_regions.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.ai_foundry.module.avm_utl_regions.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.ai_foundry.module.cosmosdb["this"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.ai_foundry.module.cosmosdb["this"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry.cosmosdb"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.module.cosmosdb["this"].azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = false
      + analytical_storage_enabled                   = true
      + automatic_failover_enabled                   = true
      + burst_capacity_enabled                       = false
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = false
      + id                                           = (known after apply)
      + ip_range_filter                              = [
          + "0.0.0.0",
          + "104.42.195.92",
          + "168.125.123.255",
          + "170.0.0.0/24",
          + "40.76.54.131",
          + "52.169.50.45",
          + "52.176.6.30",
          + "52.187.184.26",
        ]
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = (known after apply)
      + minimal_tls_version                          = "Tls12"
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = false
      + name                                         = (known after apply)
      + network_acl_bypass_for_azure_services        = true
      + network_acl_bypass_ids                       = []
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = false
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = (known after apply)
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + tier                = "Continuous30Days"
          + type                = "Continuous"
        }

      + capabilities (known after apply)

      + capacity {
          + total_throughput_limit = -1
        }

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = (known after apply)
          + zone_redundant    = false
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = (known after apply)
          + zone_redundant    = false
        }
    }

  # module.ai_foundry.module.cosmosdb["this"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.ai_foundry.module.cosmosdb["this"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.ai_foundry.module.key_vault["this"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.ai_foundry.module.key_vault["this"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry.key_vault"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.module.key_vault["this"].azurerm_key_vault.this will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = (known after apply)
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = (known after apply)
      + sku_name                        = "premium"
      + soft_delete_retention_days      = 90
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.ai_foundry.module.key_vault["this"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.ai_foundry.module.key_vault["this"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.ai_foundry.module.storage_account["this"].data.azurerm_client_config.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "telemetry" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.ai_foundry.module.storage_account["this"].data.modtm_module_source.telemetry[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "modtm_module_source" "telemetry" {
      + module_path    = ".terraform/modules/ai_foundry.storage_account"
      + module_source  = (known after apply)
      + module_version = (known after apply)
    }

  # module.ai_foundry.module.storage_account["this"].azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = (known after apply)
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = (known after apply)
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.ai_foundry.module.storage_account["this"].modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = (known after apply)
          + "module_source"   = (known after apply)
          + "module_version"  = (known after apply)
          + "random_id"       = (known after apply)
          + "subscription_id" = (known after apply)
          + "tenant_id"       = (known after apply)
        }
    }

  # module.ai_foundry.module.storage_account["this"].random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rg_name = (known after apply)

Warning: Argument is deprecated

  with module.ai_foundry.module.key_vault["this"].azurerm_key_vault.this,
  on .terraform/modules/ai_foundry.key_vault/main.tf line 7, in resource "azurerm_key_vault" "this":
   7:   enable_rbac_authorization       = !var.legacy_access_policies_enabled

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*